testCases/CBFS13700_KOSSTSEP/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;

endTime         2800;

deltaT          1;

writeControl    timeStep;

writeInterval   400;

purgeWrite      1;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   15;

runTimeModifiable yes;
libs ("libSEPIncompressibleTurbulenceModels");

functions
{
    wallShearStress
    {
    type        wallShearStress;
    outputControl timeStep;
    outputInterval $writeInterval;
    }

}