testCases/CBFS13700_KOSSTSEP/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
        (-7.34   1.0    -.1  )//0
        (15.4   0.0    -.1  )//1
        (15.4   5.0    -.1  )//2
        (-7.34   5.0    -.1  )//3
        (-7.34   1.0     .1  )//4
        (15.4   0.0     .1  )//5
        (15.4   5.0     .1  )//6
        (-7.34   5.0     .1  )//7
        (15.4   9.48  -.1  )//8
        (-7.34   9.48  -.1  )//9
        (-7.34   9.48   .1  )//10
        (15.4   9.48   .1  )//11
);

blocks
(
        //hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
        hex (0 1 2 3 4 5 6 7)   (180 100 1) simpleGrading (1 10 1)
        hex (3 2 8 9 7 6 11 10) (180 100 1) simpleGrading (1 .1 1)
);


//EDGES-START
edges
(
spline 0 1 (
(-7.3 1.0 -.1)
(-7.29239746582 1.0 -.1)
(-7.28479493164 1.0 -.1)
(-7.27719239747 1.0 -.1)
(-7.26958986329 1.0 -.1)
(-7.26198732911 1.0 -.1)
(-7.25438479493 1.0 -.1)
(-7.24678226075 1.0 -.1)
(-7.23917972658 1.0 -.1)
(-7.2315771924 1.0 -.1)
(-7.22397465822 1.0 -.1)
(-7.21637212404 1.0 -.1)
(-7.20876958986 1.0 -.1)
(-7.20116705569 1.0 -.1)
(-7.19356452151 1.0 -.1)
(-7.18596198733 1.0 -.1)
(-7.17835945315 1.0 -.1)
(-7.17075691897 1.0 -.1)
(-7.16315438479 1.0 -.1)
(-7.15555185062 1.0 -.1)
(-7.14794931644 1.0 -.1)
(-7.14034678226 1.0 -.1)
(-7.13274424808 1.0 -.1)
(-7.1251417139 1.0 -.1)
(-7.11753917973 1.0 -.1)
(-7.10993664555 1.0 -.1)
(-7.10233411137 1.0 -.1)
(-7.09473157719 1.0 -.1)
(-7.08712904301 1.0 -.1)
(-7.07952650884 1.0 -.1)
(-7.07192397466 1.0 -.1)
(-7.06432144048 1.0 -.1)
(-7.0567189063 1.0 -.1)
(-7.04911637212 1.0 -.1)
(-7.04151383795 1.0 -.1)
(-7.03391130377 1.0 -.1)
(-7.02630876959 1.0 -.1)
(-7.01870623541 1.0 -.1)
(-7.01110370123 1.0 -.1)
(-7.00350116706 1.0 -.1)
(-6.99589863288 1.0 -.1)
(-6.9882960987 1.0 -.1)
(-6.98069356452 1.0 -.1)
(-6.97309103034 1.0 -.1)
(-6.96548849617 1.0 -.1)
(-6.95788596199 1.0 -.1)
(-6.95028342781 1.0 -.1)
(-6.94268089363 1.0 -.1)
(-6.93507835945 1.0 -.1)
(-6.92747582528 1.0 -.1)
(-6.9198732911 1.0 -.1)
(-6.91227075692 1.0 -.1)
(-6.90466822274 1.0 -.1)
(-6.89706568856 1.0 -.1)
(-6.88946315438 1.0 -.1)
(-6.88186062021 1.0 -.1)
(-6.87425808603 1.0 -.1)
(-6.86665555185 1.0 -.1)
(-6.85905301767 1.0 -.1)
(-6.85145048349 1.0 -.1)
(-6.84384794932 1.0 -.1)
(-6.83624541514 1.0 -.1)
(-6.82864288096 1.0 -.1)
(-6.82104034678 1.0 -.1)
(-6.8134378126 1.0 -.1)
(-6.80583527843 1.0 -.1)
(-6.79823274425 1.0 -.1)
(-6.79063021007 1.0 -.1)
(-6.78302767589 1.0 -.1)
(-6.77542514171 1.0 -.1)
(-6.76782260754 1.0 -.1)
(-6.76022007336 1.0 -.1)
(-6.75261753918 1.0 -.1)
(-6.745015005 1.0 -.1)
(-6.73741247082 1.0 -.1)
(-6.72980993665 1.0 -.1)
(-6.72220740247 1.0 -.1)
(-6.71460486829 1.0 -.1)
(-6.70700233411 1.0 -.1)
(-6.69939979993 1.0 -.1)
(-6.69179726576 1.0 -.1)
(-6.68419473158 1.0 -.1)
(-6.6765921974 1.0 -.1)
(-6.66898966322 1.0 -.1)
(-6.66138712904 1.0 -.1)
(-6.65378459486 1.0 -.1)
(-6.64618206069 1.0 -.1)
(-6.63857952651 1.0 -.1)
(-6.63097699233 1.0 -.1)
(-6.62337445815 1.0 -.1)
(-6.61577192397 1.0 -.1)
(-6.6081693898 1.0 -.1)
(-6.60056685562 1.0 -.1)
(-6.59296432144 1.0 -.1)
(-6.58536178726 1.0 -.1)
(-6.57775925308 1.0 -.1)
(-6.57015671891 1.0 -.1)
(-6.56255418473 1.0 -.1)
(-6.55495165055 1.0 -.1)
(-6.54734911637 1.0 -.1)
...
)
spline 4 5 (
(-7.3 1.0 .1)
(-7.29239746582 1.0 .1)
(-7.28479493164 1.0 .1)
(-7.27719239747 1.0 .1)
(-7.26958986329 1.0 .1)
(-7.26198732911 1.0 .1)
(-7.25438479493 1.0 .1)
(-7.24678226075 1.0 .1)
(-7.23917972658 1.0 .1)
(-7.2315771924 1.0 .1)
(-7.22397465822 1.0 .1)
(-7.21637212404 1.0 .1)
(-7.20876958986 1.0 .1)
(-7.20116705569 1.0 .1)
(-7.19356452151 1.0 .1)
(-7.18596198733 1.0 .1)
(-7.17835945315 1.0 .1)
(-7.17075691897 1.0 .1)
(-7.16315438479 1.0 .1)
(-7.15555185062 1.0 .1)
(-7.14794931644 1.0 .1)
(-7.14034678226 1.0 .1)
(-7.13274424808 1.0 .1)
(-7.1251417139 1.0 .1)
(-7.11753917973 1.0 .1)
(-7.10993664555 1.0 .1)
(-7.10233411137 1.0 .1)
(-7.09473157719 1.0 .1)
(-7.08712904301 1.0 .1)
(-7.07952650884 1.0 .1)
(-7.07192397466 1.0 .1)
(-7.06432144048 1.0 .1)
(-7.0567189063 1.0 .1)
(-7.04911637212 1.0 .1)
(-7.04151383795 1.0 .1)
(-7.03391130377 1.0 .1)
(-7.02630876959 1.0 .1)
(-7.01870623541 1.0 .1)
(-7.01110370123 1.0 .1)
(-7.00350116706 1.0 .1)
(-6.99589863288 1.0 .1)
(-6.9882960987 1.0 .1)
(-6.98069356452 1.0 .1)
(-6.97309103034 1.0 .1)
(-6.96548849617 1.0 .1)
(-6.95788596199 1.0 .1)
(-6.95028342781 1.0 .1)
(-6.94268089363 1.0 .1)
(-6.93507835945 1.0 .1)
(-6.92747582528 1.0 .1)
(-6.9198732911 1.0 .1)
(-6.91227075692 1.0 .1)
(-6.90466822274 1.0 .1)
(-6.89706568856 1.0 .1)
(-6.88946315438 1.0 .1)
(-6.88186062021 1.0 .1)
(-6.87425808603 1.0 .1)
(-6.86665555185 1.0 .1)
(-6.85905301767 1.0 .1)
(-6.85145048349 1.0 .1)
(-6.84384794932 1.0 .1)
(-6.83624541514 1.0 .1)
(-6.82864288096 1.0 .1)
(-6.82104034678 1.0 .1)
(-6.8134378126 1.0 .1)
(-6.80583527843 1.0 .1)
(-6.79823274425 1.0 .1)
(-6.79063021007 1.0 .1)
(-6.78302767589 1.0 .1)
(-6.77542514171 1.0 .1)
(-6.76782260754 1.0 .1)
(-6.76022007336 1.0 .1)
(-6.75261753918 1.0 .1)
(-6.745015005 1.0 .1)
(-6.73741247082 1.0 .1)
(-6.72980993665 1.0 .1)
(-6.72220740247 1.0 .1)
(-6.71460486829 1.0 .1)
(-6.70700233411 1.0 .1)
(-6.69939979993 1.0 .1)
(-6.69179726576 1.0 .1)
(-6.68419473158 1.0 .1)
(-6.6765921974 1.0 .1)
(-6.66898966322 1.0 .1)
(-6.66138712904 1.0 .1)
(-6.65378459486 1.0 .1)
(-6.64618206069 1.0 .1)
(-6.63857952651 1.0 .1)
(-6.63097699233 1.0 .1)
(-6.62337445815 1.0 .1)
(-6.61577192397 1.0 .1)
(-6.6081693898 1.0 .1)
(-6.60056685562 1.0 .1)
(-6.59296432144 1.0 .1)
(-6.58536178726 1.0 .1)
(-6.57775925308 1.0 .1)
(-6.57015671891 1.0 .1)
(-6.56255418473 1.0 .1)
(-6.55495165055 1.0 .1)
(-6.54734911637 1.0 .1)
...
);
//EDGES-END
//EDGES-END
//EDGES-END


boundary
(
    bottomWall
    {
        type            wall;
        faces           ((4 0 1 5));
    }
    
    topWall
    {
        type            wall;
        faces           ((10 11 8 9));
    }

    inlet
    {
        type            patch;
        faces
	(
	 (7 3 0 4)
	 (7 10 9 3)
	);
    }

    outlet
    {
        type            patch;
        faces
	(
	 (6 5 1 2)
	 (11 6 2 8)
	);
    }

    frontAndBack
    {
        type            empty;
        faces
	(
	 (6 7 4 5)
	 (10 7 6 11)
	 (0 3 2 1)
	 (3 9 8 2)
	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
