testCases/CBFS13700_KOSSTSEP/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "424";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
71620
(
0.000293065827365432
-1.66525948347441e-06
0.00028415391859078
8.91190851579522e-06
0.000274876138401007
9.27777985151727e-06
0.000268137364341677
6.73877371780797e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
-0.000291400567980515
-0.000784946834247496
-0.00107369881054272
-0.00124827365787449
-0.00137197681684662
-0.00147083184912011
-0.00155597531260806
-0.001633962743669
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.000299670696999912
0.000748493164733917
0.000998123659652842
0.00114771891421851
0.00125538638363393
0.00134267005823625
0.00141916186854989
0.0014897018287876
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
