testCases/CBFS13700_KOSSTSEP/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
180
(
(-0.0020592807834846 -1.36072423737388e-07 0)
(-0.00202949331523915 -3.50377596182497e-06 3.80567065772701e-24)
(-0.00196393261019296 -3.42799605157285e-06 -3.85046967974803e-24)
(-0.00190448846683005 -2.04592846821023e-06 0)
(-0.00186540504848216 -9.95059257829017e-07 8.01196528726719e-24)
(-0.00184075192157191 -4.81315546420112e-07 -8.05259864934679e-24)
(-0.00182433140707158 -2.07425297305535e-07 0)
(-0.00181359828223229 -1.20940621946251e-08 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
180
(
(-0.00536169444888055 0.000158801681763324 0)
(-0.0037815159267165 0.000124924215919836 0)
(-0.00277516520512922 5.44132372298713e-05 0)
(-0.00223015997364052 1.39667159473005e-05 0)
(-0.00199338976482937 -1.40866691474511e-07 0)
(-0.00189543973390176 -1.66869369288505e-06 0)
(-0.00184141083013694 -5.45724462413881e-07 0)
(-0.00180385179872897 -1.48224995250322e-07 0)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
